eikeviehmann/STM32_TopologyUpdateAlgorithmus/Core/Src/rf24/rf24_module/rf24_module.c
#include "rf24_module.h"

#include "nRF24L01.h"
#include "../rf24_stm32f1xx/rf24_stm32f1xx_uart.h"
#include "../rf24_stm32f1xx/rf24_stm32f1xx_spi.h"
#include "../rf24_debug.h"


//_________________________________________________________________________________________________________________________________________________________________________
// global variables

volatile rf24_module_states rf24_module_state = UNDEFINED;
volatile rf24_module_flags_t rf24_module_flags;

rf24_module_attribute_value value_in;
rf24_module_attribute_value value_out;

//_________________________________________________________________________________________________________________________________________________________________________
// rf24 attributes

/* (0) CONFIG REGISTER (ADDRESS 0) */

rf24_module_attribute prim_rx = { .type = w1_rw, .reg_addr = CONFIG, .mask = 0b11111110, .mnemonic = PRIM_RX /*0*/, .w1= { .min = false, .max = true } };

rf24_module_attribute pwr_up = { .type = w1_rw, .reg_addr = CONFIG, .mask = 0b11111101, .mnemonic = PWR_UP /*1*/, .w1= { .min = false, .max = true } };

rf24_module_attribute crc0 = { .type = w1_rw, .reg_addr = CONFIG, .mask = 0b11111011, .mnemonic = CRCO /*2*/, .w1= { .min = false, .max = true } };

rf24_module_attribute en_crc = { .type = w1_rw, .reg_addr = CONFIG, .mask = 0b11110111, .mnemonic = EN_CRC /*3*/, .w1= { .min = false, .max = true } };

rf24_module_attribute mask_max_rt = { .type = w1_rw, .reg_addr = CONFIG, .mask = 0b11101111, .mnemonic = MASK_MAX_RT /*4*/, .w1= { .min = false, .max = true } };

rf24_module_attribute mask_tx_ds = { .type = w1_rw, .reg_addr = CONFIG, .mask = 0b11011111, .mnemonic = MASK_TX_DS /*5*/, .w1= { .min = false, .max = true } };

rf24_module_attribute mask_rx_dr = { .type = w1_rw, .reg_addr = CONFIG, .mask = 0b10111111, .mnemonic = MASK_RX_DR /*6*/, .w1= { .min = false, .max = true } };

/* (1) EN_AA REGISTER (ADDRESS 1) */

rf24_module_attribute enaa_p0 = { .type = w1_rw, .reg_addr = EN_AA, .mask = 0b11111110, .mnemonic = ENAA_P0 /*0*/, .w1= { .min = false, .max = true } };

rf24_module_attribute enaa_p1 = { .type = w1_rw, .reg_addr = EN_AA, .mask = 0b11111101, .mnemonic = ENAA_P1 /*1*/, .w1= { .min = false, .max = true } };

rf24_module_attribute enaa_p2 = { .type = w1_rw, .reg_addr = EN_AA, .mask = 0b11111011, .mnemonic = ENAA_P2 /*2*/, .w1= { .min = false, .max = true } };

rf24_module_attribute enaa_p3 = { .type = w1_rw, .reg_addr = EN_AA, .mask = 0b11110111, .mnemonic = ENAA_P3 /*3*/, .w1= { .min = false, .max = true } };

rf24_module_attribute enaa_p4 = { .type = w1_rw, .reg_addr = EN_AA, .mask = 0b11101111, .mnemonic = ENAA_P4 /*4*/, .w1= { .min = false, .max = true } };

rf24_module_attribute enaa_p5 = { .type = w1_rw, .reg_addr = EN_AA, .mask = 0b11011111, .mnemonic = ENAA_P5 /*5*/, .w1= { .min = false, .max = true } };

/* (2) EN_RXADDR REGISTER (ADDRES 2) */

rf24_module_attribute erx_p0 = { .type = w1_rw, .reg_addr = EN_RXADDR, .mask = 0b11111110, .mnemonic = ERX_P0 /*0*/, .w1= { .min = false, .max = true } };

rf24_module_attribute erx_p1 = { .type = w1_rw, .reg_addr = EN_RXADDR, .mask = 0b11111101, .mnemonic = ERX_P1 /*1*/, .w1= { .min = false, .max = true } };

rf24_module_attribute erx_p2 = { .type = w1_rw, .reg_addr = EN_RXADDR, .mask = 0b11111011, .mnemonic = ERX_P2 /*2*/, .w1= { .min = false, .max = true } };

rf24_module_attribute erx_p3 = { .type = w1_rw, .reg_addr = EN_RXADDR, .mask = 0b11110111, .mnemonic = ERX_P3 /*3*/, .w1= { .min = false, .max = true } };

rf24_module_attribute erx_p4 = { .type = w1_rw, .reg_addr = EN_RXADDR, .mask = 0b11101111, .mnemonic = ERX_P4 /*4*/, .w1= { .min = false, .max = true } };

rf24_module_attribute erx_p5 = { .type = w1_rw, .reg_addr = EN_RXADDR, .mask = 0b11011111, .mnemonic = ERX_P5 /*5*/, .w1= { .min = false, .max = true } };

/* (3) SETUP_AW REGISTER (ADDRESS 3) */

rf24_module_attribute aw = { .type = w8_rw, .reg_addr = SETUP_AW, .mask = 0b11111100, .mnemonic = 0, .w8 = {.min = 1, .max = 3} };

/* (4) SETUP_RETR REGISTER (ADDRESS 4) */

rf24_module_attribute arc = { .type = w8_rw, .reg_addr = SETUP_RETR, .mask = 0b11110000, .mnemonic = ARC /*0*/, .w8 = {.min = 0, .max = 15} };

rf24_module_attribute ard = { .type = w8_rw, .reg_addr = SETUP_RETR, .mask = 0b00001111, .mnemonic = ARD /*4*/, .w8 = {.min = 0, .max = 15} };

/* (5) RF_CH REGISTER (ADDRESS 5) */

rf24_module_attribute rf_ch = { .type = w8_rw, .reg_addr = RF_CH, .mask = 0b10000000, .mnemonic = ARC /*0*/, .w8 = {.min = 0, .max = 127} };

/* (6) RF_SETUP REGISTER (ADDRESS 6) */

rf24_module_attribute rf_pwr = { .type = w8_rw, .reg_addr = RF_SETUP, .mask = 0b11111001, .mnemonic = RF_PWR /*0*/, .w8 = {.min = 0, .max = 3} };

rf24_module_attribute rf_dr_high = { .type = w1_rw, .reg_addr = RF_SETUP, .mask = 0b11110111, .mnemonic = RF_DR_HIGH /*3*/, .w1 = {.min = false, .max = true} };

rf24_module_attribute pll_lock = { .type = w1_rw, .reg_addr = RF_SETUP, .mask = 0b11101111, .mnemonic = PLL_LOCK /*4*/, .w1 = {.min = false, .max = true} };

rf24_module_attribute rf_dr_low = { .type = w1_rw, .reg_addr = RF_SETUP, .mask = 0b11011111, .mnemonic = RF_DR_LOW /*5*/, .w1 = {.min = false, .max = true} };

rf24_module_attribute cont_wave = { .type = w1_rw, .reg_addr = RF_SETUP, .mask = 0b01111111, .mnemonic = /*CONT_WAVE*/ 7, .w1 = {.min = false, .max = true} };

/* (7) STATUS REGISTER (ADDRESS 7) */

rf24_module_attribute tx_full = { .type = w1_rw, .reg_addr = STATUS, .mask = 0b11111110, .mnemonic = /*TX_FULL*/0, .w1 = {.min = false, .max = true} };

rf24_module_attribute rx_p_no = { .type = w8_rw, .reg_addr = STATUS, .mask = 0b11110001, .mnemonic = /*RX_P_NO*/1, .w8 = {.min = 0, .max = 5} };

rf24_module_attribute max_rt = { .type = w1_rw, .reg_addr = STATUS, .mask = 0b11101111, .mnemonic = /*MAX_RT*/ 4, .w1 = {.min = false, .max = true} };

rf24_module_attribute tx_ds = { .type = w1_rw, .reg_addr = STATUS, .mask = 0b11011111, .mnemonic = /*TX_DS*/5, .w1 = {.min = false, .max = true} };

rf24_module_attribute rx_dr = { .type = w1_rw, .reg_addr = STATUS, .mask = 0b10111111, .mnemonic = /*RX_DR*/6, .w1 = {.min = false, .max = true} };

/* (8) OBSERVE_TX REGISTER (ADDRESS 8) */

rf24_module_attribute arc_cnt = { .type = w8_rw, .reg_addr = /*OBSERVE_TX*/ 8, .mask = 0b11110000, .mnemonic = /*ARC_CNT*/0, .w8 = { .min = 0, .max = 15} };

