eikeviehmann/STM32_TopologyUpdateAlgorithmus/Core/Src/rf24/rf24_module/rf24_module.c
rf24_module_attribute plos_cnt = { .type = w8_rw, .reg_addr = /*OBSERVE_TX*/ 8, .mask = 0b00001111, .mnemonic = /*PLOS_CNT*/4, .w8 = { .min = 0, .max = 15} };

/* (9) RPD REGISTER (ADDRESS 9) */

rf24_module_attribute rpd = { .type = w1_rw, .reg_addr = RPD, .mask = 0b11111110, .mnemonic = /*RPD*/0, .w1 = {.min = false, .max = true} };

/* (10) RX_ADDR_P0 REGISTER (ADDRESS 0A) */

rf24_module_attribute rx_addr_p0 = { .type = w40_rw, .reg_addr = RX_ADDR_P0, .w40 = { .max_length = 5 } };

/* (11) RX_ADDR_P1 REGISTER (ADDRESS 0B) */

rf24_module_attribute rx_addr_p1 = { .type = w40_rw, .reg_addr = RX_ADDR_P1, .w40 = { .max_length = 5 } };

/* (12) RX_ADDR_P2 REGISTER (ADDRESS 0C) */

rf24_module_attribute rx_addr_p2 = { .type = w8_rw, .reg_addr = RX_ADDR_P2, .mask = 0b00000000, .mnemonic = 0, .w8 = { .min = 0, .max = 255} };

/* (13) RX_ADDR_P3 REGISTER (ADDRESS 0D) */

rf24_module_attribute rx_addr_p3 = { .type = w8_rw, .reg_addr = RX_ADDR_P3, .mask = 0b00000000, .mnemonic = 0, .w8 = { .min = 0, .max = 255} };

/* (14) RX_ADDR_P4 REGISTER (ADDRESS 0E) */

rf24_module_attribute rx_addr_p4 = { .type = w8_rw, .reg_addr = RX_ADDR_P4, .mask = 0b00000000, .mnemonic = 0, .w8 = { .min = 0, .max = 255} };

/* (15) RX_ADDR_P5 REGISTER (ADDRESS 0F) */

rf24_module_attribute rx_addr_p5 = { .type = w8_rw, .reg_addr = RX_ADDR_P5, .mask = 0b00000000, .mnemonic = 0, .w8 = { .min = 0, .max = 255} };

/* (16) TX_ADDR REGISTER (ADDRESS 10) */

rf24_module_attribute tx_addr = { .type = w40_rw, .reg_addr = TX_ADDR, .w40 = { .max_length = 5 } };

/* (17) RX_PW_P0 REGISTER (ADDRESS 11) */

rf24_module_attribute rx_pw_p0 = { .type = w8_rw, .reg_addr = RX_PW_P0, .mask = 0b11000000, .mnemonic = 0, .w8 = { .min = 0, .max = 32} };

/* (18) RX_PW_P1 REGISTER (ADDRESS 12) */

rf24_module_attribute rx_pw_p1 = { .type = w8_rw, .reg_addr = RX_PW_P1, .mask = 0b11000000, .mnemonic = 0, .w8 = { .min = 0, .max = 32} };

/* (19) RX_PW_P2 REGISTER (ADDRESS 13) */

rf24_module_attribute rx_pw_p2 = { .type = w8_rw, .reg_addr = RX_PW_P2, .mask = 0b11000000, .mnemonic = 0, .w8 = { .min = 0, .max = 32} };

/* (20) RX_PW_P3 REGISTER (ADDRESS 14) */

rf24_module_attribute rx_pw_p3 = { .type = w8_rw, .reg_addr = RX_PW_P3, .mask = 0b11000000, .mnemonic = 0, .w8 = { .min = 0, .max = 32} };

/* (21) RX_PW_P4 REGISTER (ADDRESS 15) */

rf24_module_attribute rx_pw_p4 = { .type = w8_rw, .reg_addr = RX_PW_P4, .mask = 0b11000000, .mnemonic = 0, .w8 = { .min = 0, .max = 32} };

/* (22) RX_PW_P5 REGISTER (ADDRESS 16) */

rf24_module_attribute rx_pw_p5 = { .type = w8_rw, .reg_addr = RX_PW_P5, .mask = 0b11000000, .mnemonic = 0, .w8 = { .min = 0, .max = 32} };

/* (23) FIFO_STATUS REGISTER (ADDRESS 17) */

rf24_module_attribute rx_empty = { .type = w1_r, .reg_addr = FIFO_STATUS, .mask = 0b11111110, .mnemonic = /*RX_EMPTY*/0, .w1 = { .min = false, .max = true} };

rf24_module_attribute rx_full = { .type = w1_r, .reg_addr = FIFO_STATUS, .mask = 0b11111101, .mnemonic = /*RX_FULL*/1, .w1 = { .min = false, .max = true} };

rf24_module_attribute tx_empty = { .type = w1_r, .reg_addr = FIFO_STATUS, .mask = 0b11101111, .mnemonic = /*TX_EMPTY*/4, .w1 = { .min = false, .max = true} };

rf24_module_attribute tx_reuse = { .type = w1_r, .reg_addr = FIFO_STATUS, .mask = 0b10111111, .mnemonic = /*TX_REUSE*/6, .w1 = { .min = false, .max = true} };

/* (24) DYNPD REGISTER (ADDRESS 1C) */

rf24_module_attribute dpl_p0 = { .type = w1_rw, .reg_addr = /*DYNPD*/0x1C, .mask = 0b11111110, .mnemonic = /*DPL_P0*/0, .w1 = { .min = false, .max = true} };

rf24_module_attribute dpl_p1 = { .type = w1_rw, .reg_addr = /*DYNPD*/0x1C, .mask = 0b11111101, .mnemonic = /*DPL_P1*/1, .w1 = { .min = false, .max = true} };

rf24_module_attribute dpl_p2 = { .type = w1_rw, .reg_addr = /*DYNPD*/0x1C, .mask = 0b11111011, .mnemonic = /*DPL_P2*/2, .w1 = { .min = false, .max = true} };

rf24_module_attribute dpl_p3 = { .type = w1_rw, .reg_addr = /*DYNPD*/0x1C, .mask = 0b11110111, .mnemonic = /*DPL_P3*/3, .w1 = { .min = false, .max = true} };

rf24_module_attribute dpl_p4 = { .type = w1_rw, .reg_addr = /*DYNPD*/0x1C, .mask = 0b11101111, .mnemonic = /*DPL_P4*/4, .w1 = { .min = false, .max = true} };

rf24_module_attribute dpl_p5 = { .type = w1_rw, .reg_addr = /*DYNPD*/0x1C, .mask = 0b11011111, .mnemonic = /*DPL_P5*/5, .w1 = { .min = false, .max = true} };


/* (25) FEATURE REGISTER (ADDRESS 1D) */

rf24_module_attribute en_dyn_ack = { .type = w1_rw, .reg_addr = /*FEATRUE*/0x1D, .mask = 0b11111110, .mnemonic = /*EN_DYN_ACK*/0, .w1 = { .min = false, .max = true} };

rf24_module_attribute en_ack_pay = { .type = w1_rw, .reg_addr = /*FEATRUE*/0x1D, .mask = 0b11111101, .mnemonic = /*EN_ACK_PAY*/1, .w1 = { .min = false, .max = true} };

rf24_module_attribute en_dpl = { .type = w1_r, .reg_addr = /*FEATRUE*/0x1D, .mask = 0b11111011, .mnemonic = /*EN_DPL*/2, .w1 = { .min = false, .max = true} };

/* ATTRBIUTE REGISTER STRUCT*/

rf24_module_attributes_struct rf24_module_attributes = {
	.prim_rx = &prim_rx,
	.pwr_up = &pwr_up,
	.crc0 = &crc0,
	.en_crc = &en_crc,
	.mask_max_rt =&mask_max_rt,
	.mask_tx_ds =& mask_tx_ds,
	.mask_rx_dr =& mask_rx_dr,
	.enaa_p0 = &enaa_p0,
	.enaa_p1 = &enaa_p1,
	.enaa_p2 = &enaa_p2,
	.enaa_p3 = &enaa_p3,
	.enaa_p4 = &enaa_p4,
	.enaa_p5 = &enaa_p5,
	.erx_p0 = &erx_p0,
	.erx_p1 = &erx_p1,
	.erx_p2 = &erx_p2,
	.erx_p3 = &erx_p3,
	.erx_p4 = &erx_p4,
	.erx_p5 = &erx_p5,
	.aw = &aw,
	.arc = &arc,
	.ard = &ard,
	.rf_ch = &rf_ch,
	.rf_pwr = &rf_pwr,
	.rf_dr_high = &rf_dr_high,
	.pll_lock = &pll_lock,
	.rf_dr_low = &rf_dr_low,
	.cont_wave = &cont_wave,
	.tx_full = &tx_full,
	.rx_p_no = &rx_p_no,
	.max_rt = &max_rt,
	.tx_ds = &tx_ds,
	.rx_dr = &rx_dr,
	.arc_cnt = &arc_cnt,
	.plos_cnt = &plos_cnt,
	.rpd = &rpd,
	.rx_addr_p0 = &rx_addr_p0,
	.rx_addr_p1 = &rx_addr_p1,
	.rx_addr_p2 = &rx_addr_p2,
	.rx_addr_p2 = &rx_addr_p3,
	.rx_addr_p3 = &rx_addr_p4,
	.rx_addr_p5 = &rx_addr_p5,
	.tx_addr = &tx_addr,
	.rx_pw_p0 = &rx_pw_p0,
	.rx_pw_p1 = &rx_pw_p1,
	.rx_pw_p2 = &rx_pw_p2,
	.rx_pw_p3 = &rx_pw_p3,
	.rx_pw_p4= &rx_pw_p4,
	.rx_pw_p5 = &rx_pw_p5,
	.rx_empty = &rx_empty,
	.rx_full = &rx_full,
	.tx_reuse = &tx_reuse,
	.dpl_p0 = &dpl_p0,
	.dpl_p1 = &dpl_p1,
	.dpl_p2 = &dpl_p2,
	.dpl_p3 = &dpl_p3,
	.dpl_p4 = &dpl_p4,
	.dpl_p5 = &dpl_p5,
	.en_dyn_ack = &en_dyn_ack,
	.en_ack_pay = &en_ack_pay,
	.en_dpl = &en_dpl
};

//_________________________________________________________________________________________________________________________________________________________________________
//INTERRUPT SERVICE ROUTINES


//_________________________________________________________________________________________________________________________________________________________________________
// FUNCTIONS

// REGISTER ACCESS

uint8_t rf24_module_read_register(uint8_t register_name)
{
	rf24_stm32f1xx_spi_csn_low();

	rf24_stm32f1xx_spi_shift_byte(R_REGISTER | (REGISTER_MASK & register_name));

