eikeviehmann/STM32_TopologyUpdateAlgorithmus/Core/Src/rf24/rf24_module/rf24_module.c
	uint8_t value = rf24_stm32f1xx_spi_shift_byte(NOP);

	rf24_stm32f1xx_spi_csn_high();

	return value;
}

uint8_t rf24_module_write_register(uint8_t register_name, uint8_t data)
{
	rf24_stm32f1xx_spi_csn_low();

	rf24_stm32f1xx_spi_shift_byte(W_REGISTER | (REGISTER_MASK & register_name));

	uint8_t status = rf24_stm32f1xx_spi_shift_byte(data);

	rf24_stm32f1xx_spi_csn_high();

	return status;
}

void rf24_module_readwrite_register(rf24_module_read_write read_write, uint8_t register_name, uint8_t *data_inout, uint8_t length)
{
	if (read_write == write && register_name != W_TX_PAYLOAD && register_name != W_TX_PAYLOAD_NO_ACK)
	{
		register_name = W_REGISTER + register_name;
	}

	rf24_stm32f1xx_spi_csn_low();

	rf24_stm32f1xx_spi_shift_byte(register_name);

	for(int i=0; i<length; i++)
	{
		if(read_write == read)
		{
			data_inout[i] = rf24_stm32f1xx_spi_shift_byte(NOP);
		}
		if(read_write == write)
		{
			rf24_stm32f1xx_spi_shift_byte(data_inout[i]);
		}
	}

	rf24_stm32f1xx_spi_csn_high();
}

// FUNCTON ACCESS

bool rf24_module_write_attribute(rf24_module_attribute *attribute, rf24_module_attribute_value *value_in)
{
	switch(attribute->type)
	{
		/* w1: set/clear bit in register */
		case w1_rw:
		{
			if(value_in->w1 >= attribute->w1.min && value_in->w1 <= attribute->w1.max)
			{
				uint8_t rf24_module_register = rf24_module_read_register(attribute->reg_addr) & attribute->mask;
				rf24_module_register |= ( (value_in->w1) << attribute->mnemonic );
				rf24_module_write_register(attribute->reg_addr, rf24_module_register);
				return true;
			}
			else
			{
				#ifdef DEBUG
					rf24_stm32f1xx_usart_write_line("[i] input of wrong value or wrong format!");
				#endif
				return false;
			}
			return true;
		}

		/* w8: set/clear bits of register */
		case w8_rw:
		{
			if(value_in->w8 >= attribute->w8.min && value_in->w8 <= attribute->w8.max)
			{
				uint8_t rf24_module_register = rf24_module_read_register(attribute->reg_addr) & attribute->mask;
				rf24_module_register |= (value_in->w8) << attribute->mnemonic;
				rf24_module_write_register(attribute->reg_addr, rf24_module_register);
				return true;
			}
			else
			{
				#ifdef DEBUG
					rf24_stm32f1xx_usart_write_line("[i] input of wrong value or wrong format!");
				#endif
				return false;
			}
		}

		/* w40: write into register w40 (5x8byte)*/
		case w40_rw:
		{
			rf24_module_readwrite_register(write, attribute->reg_addr, value_in->w40, 5);
			return true;
		}
		default:break;
	}

	return false;
}

bool rf24_module_read_attribute(rf24_module_attribute *attribute, rf24_module_attribute_value *value_out)
{
	switch(attribute->type){

		case w1_r:
		case w1_rw:{
			uint8_t reg = rf24_module_read_register(attribute->reg_addr) & ~(attribute->mask);
			uint8_t reg_value = reg >> attribute->mnemonic;
			value_out->w1 = reg_value;
			return true;
		}

		case w8_r:
		case w8_rw:
		{
			uint8_t reg = rf24_module_read_register(attribute->reg_addr) & ~(attribute->mask);
			uint8_t reg_value = reg >> attribute->mnemonic;
			value_out->w8 = reg_value;
			return true;

			//usart_write_line(decimal_to_binary(rf24_module_register_value));
		}

		case w40_r:
		case w40_rw:
		{
			rf24_module_readwrite_register(read, attribute->reg_addr, value_out->w40, 5);
			return true;
		}
	}

	return false;
}

rf24_module_attribute_value* rf24_module_value_w1(bool value){
	value_in.w1 = value;
	return &value_in;
}

rf24_module_attribute_value* rf24_module_value_w8(uint8_t value){
	value_in.w8 = value;
	return &value_in;
}

rf24_module_attribute_value* rf24_module_value_w40(uint8_t *value, uint8_t value_length){
	value_in.w40 = value;
	value_in.length = value_length;
	return &value_in;
}

// NRF24L01 INTERNAL FUNCTIONS

void rf24_module_set_ce(rf24_stm32f1xx_pin_state ce_state)
{
	switch(ce_state)
	{
		case high: rf24_stm32f1xx_ce_high(); break;
		case low: rf24_stm32f1xx_ce_low(); break;
	}
}

// NRF24L01 USER EXPORT FUNCTIONS

// REGISTER ACCESS FUNCTIONS

void rf24_module_set_prim_rx(rf24_stm32f1xx_pin_state prim_rx_state)
{
	switch(prim_rx_state)
	{
		case high:
			rf24_module_write_attribute(rf24_module_attributes.prim_rx, rf24_module_value_w1(true));
			break;
		case low:
			rf24_module_write_attribute(rf24_module_attributes.prim_rx, rf24_module_value_w1(false));
			break;
	}
}

void rf24_module_power_up()
{
	rf24_module_write_attribute(rf24_module_attributes.pwr_up, rf24_module_value_w1(true));
}

void rf24_module_power_down()
{
	rf24_module_write_attribute(rf24_module_attributes.pwr_up, rf24_module_value_w1(false));
}

void rf24_module_enable_crc()
{
	rf24_module_write_attribute(rf24_module_attributes.en_crc, rf24_module_value_w1(true));
}

void rf24_module_disable_crc()
{
	rf24_module_write_attribute(rf24_module_attributes.en_crc, rf24_module_value_w1(false));
}

bool rf24_module_crc_enabled()
{
	rf24_module_read_attribute(rf24_module_attributes.en_crc, &value_out);
	return value_out.w1;
}

void rf24_module_set_crc_length(rf24_module_crc_length crc_length)
{
	rf24_module_write_attribute(rf24_module_attributes.crc0, rf24_module_value_w1(crc_length));
}

rf24_module_crc_length rf24_module_get_crc_length()
{
	rf24_module_read_attribute(rf24_module_attributes.crc0, &value_out);
	return (rf24_module_crc_length) value_out.w1;
}

void rf24_module_enable_max_retries_interrupt()
{
	rf24_module_write_attribute(rf24_module_attributes.mask_max_rt, rf24_module_value_w1(false));
}

void rf24_module_disable_max_retries_interrupt()
{
	rf24_module_write_attribute(rf24_module_attributes.mask_max_rt, rf24_module_value_w1(true));
}

void rf24_module_enable_tx_data_sent_interrupt()
{
	rf24_module_write_attribute(rf24_module_attributes.mask_tx_ds, rf24_module_value_w1(false));
}

void rf24_module_disable_tx_data_sent_interrupt()
{
	rf24_module_write_attribute(rf24_module_attributes.mask_tx_ds, rf24_module_value_w1(true));
}

void rf24_module_enable_rx_data_read_interrupt()
{
	rf24_module_write_attribute(rf24_module_attributes.mask_rx_dr, rf24_module_value_w1(false));
}

void rf24_module_disable_rx_data_read_interrupt()
{
	rf24_module_write_attribute(rf24_module_attributes.mask_rx_dr, rf24_module_value_w1(true));
}

