eikeviehmann/STM32_TopologyUpdateAlgorithmus/Core/Src/rf24/rf24_module/rf24_module.c
void rf24_module_enable_autoack_pipe(rf24_module_rx_pipes rx_pipes)
{
	uint8_t en_aa = rf24_module_read_register(EN_AA);

	if(!(en_aa & (1<<rx_pipes))){
		rf24_module_write_register(EN_AA, rf24_module_read_register(EN_AA) | (1<<rx_pipes));
	}
}

void rf24_module_disable_autoack_pipe(rf24_module_rx_pipes rx_pipes)
{
	uint8_t en_aa = rf24_module_read_register(EN_AA);

	if(en_aa & (1<<rx_pipes)){
		rf24_module_write_register(EN_AA, rf24_module_read_register(EN_AA) | (1<<rx_pipes));
	}
}

void rf24_module_enable_rx_pipe(rf24_module_rx_pipes rx_pipes)
{
	rf24_module_write_register(EN_RXADDR, rf24_module_read_register(EN_RXADDR) | (1<<rx_pipes));
}

void rf24_module_set_address_width(rf24_module_address_width address_width)
{
	rf24_module_write_attribute(rf24_module_attributes.aw, rf24_module_value_w8(address_width - rf24_module_address_width_offset));
}

rf24_module_address_width rf24_module_get_address_width()
{
	rf24_module_read_attribute(rf24_module_attributes.aw, &value_out);
	return (rf24_module_address_width) value_out.w8 + rf24_module_address_width_offset;
}

void rf24_module_set_autoretransmit_delay(rf24_module_autoretransmit_delay autoretransmit_delay)
{
	rf24_module_write_attribute(rf24_module_attributes.ard, rf24_module_value_w8(autoretransmit_delay));
}

rf24_module_autoretransmit_delay rf24_module_get_autoretransmit_delay()
{
	rf24_module_read_attribute(rf24_module_attributes.ard, &value_out);
	return (rf24_module_autoretransmit_delay) value_out.w8;
}

void rf24_module_set_autoretransmit_count(rf24_module_autoretransmit_count autoretransmit_count)
{
	rf24_module_write_attribute(rf24_module_attributes.arc, rf24_module_value_w8(autoretransmit_count));
}

rf24_module_autoretransmit_count rf24_module_get_autoretransmit_count()
{
	rf24_module_read_attribute(rf24_module_attributes.arc, &value_out);
	return (rf24_module_autoretransmit_count) value_out.w8;
}

void rf24_module_set_rf_channel(uint8_t rfchannel)
{
	rf24_module_write_attribute(rf24_module_attributes.rf_ch, rf24_module_value_w8(rfchannel));
}

uint8_t rf24_module_get_rf_channel()
{
	rf24_module_read_attribute(rf24_module_attributes.rf_ch, &value_out);
	return value_out.w8;
}

void rf24_module_set_rf_outputpower(rf24_module_rf_output_power rf_output_power)
{
	rf24_module_write_attribute(rf24_module_attributes.rf_pwr, rf24_module_value_w8(rf_output_power));
}

rf24_module_rf_output_power rf24_module_get_rf_outputpower()
{
	rf24_module_read_attribute(rf24_module_attributes.rf_pwr, &value_out);
	return (rf24_module_rf_output_power) value_out.w8;
}

void rf24_module_set_datarate(rf24_module_datarate datarate)
{
	switch(datarate)
	{
		case rf24_module_datarate_250kbps:
			rf24_module_write_attribute(rf24_module_attributes.rf_dr_low, rf24_module_value_w1(true));
			break;
		case rf24_module_datarate_1Mbps:
		case rf24_module_datarate_2Mbps:
			rf24_module_write_attribute(rf24_module_attributes.rf_dr_low, rf24_module_value_w1(false));
			rf24_module_write_attribute(rf24_module_attributes.rf_dr_high, rf24_module_value_w1(datarate));
			break;
	}
}

rf24_module_datarate rf24_module_get_datarate()
{
	rf24_module_read_attribute(rf24_module_attributes.rf_dr_low, &value_out);
	bool rf_dr_low = value_out.w1;

	if(rf_dr_low) return rf24_module_datarate_250kbps;

	rf24_module_read_attribute(rf24_module_attributes.rf_dr_high, &value_out);
	bool rf_dr_high = value_out.w1;

	return (rf24_module_datarate) rf_dr_high;
}

void rf24_module_set_cont_wave(rf24_stm32f1xx_pin_state bit_state)
{
	rf24_module_write_attribute(rf24_module_attributes.cont_wave, rf24_module_value_w1(bit_state));
}

// STAUTS REGISTER FUNCTIONS

bool rf24_module_tx_fifo_full()
{
	rf24_module_read_attribute(rf24_module_attributes.tx_full, &value_out);
	return (value_out.w1 == 1);
}

rf24_module_rx_pipes rf24_module_get_rx_available_pipe()
{
	rf24_module_read_attribute(rf24_module_attributes.rx_p_no, &value_out);
	return (rf24_module_rx_pipes) value_out.w8;
}

bool rf24_module_max_retransmits()
{
	rf24_module_read_attribute(rf24_module_attributes.max_rt, &value_out);
	return (value_out.w1 == 1);
}

void rf24_module_clear_max_retransmit_interrupt()
{
	rf24_module_read_attribute(rf24_module_attributes.max_rt, rf24_module_value_w1(true));
}

bool rf24_module_package_transmitted()
{
	rf24_module_read_attribute(rf24_module_attributes.tx_ds, &value_out);
	return (value_out.w1 == 1);
}

void rf24_module_clear_package_transmitted_interrupt()
{
	//rf24_module_read_attribute(rf24_module_attributes.tx_ds, rf24_module_value_w1(true));
	uint8_t status = rf24_module_read_register(STATUS);
	rf24_module_write_register(STATUS, status & (1<<TX_DS) );
}

bool rf24_module_rx_data_available()
{
	rf24_module_read_attribute(rf24_module_attributes.rx_dr, &value_out);
	return (value_out.w1 == 1);
}

void rf24_module_clear_rx_data_interrupt()
{
	//rf24_module_read_attribute(rf24_module_attributes.rx_dr, rf24_module_value_w1(true));
	uint8_t status = rf24_module_read_register(STATUS);
	rf24_module_write_register(STATUS, status & (1<<RX_DR) );
}

void rf24_module_clear_all_interrupts()
{
	uint8_t status = rf24_module_read_register(STATUS);
	rf24_module_write_register(STATUS, status & ( (1<<MAX_RT) | (1<<TX_DS) | (1<<RX_DR) ) );
}

uint8_t rf24_module_get_retransmitted_count(){
	rf24_module_read_attribute(rf24_module_attributes.arc, &value_out);
	return value_out.w8;
}

uint8_t rf24_module_get_packagelost_count(){
	rf24_module_read_attribute(rf24_module_attributes.plos_cnt, &value_out);
	return value_out.w8;
}

uint8_t rf24_module_get_received_power_detector(){
	return 0;
}

void rf24_module_set_rx_address_pipe0(uint8_t *rx_address /*3-5 bytes*/, uint8_t rx_address_length){
	rf24_module_write_attribute(rf24_module_attributes.rx_addr_p0, rf24_module_value_w40(rx_address, rx_address_length));
}

void rf24_module_set_rx_address_pipe1(uint8_t *rx_address /*3-5 bytes*/, uint8_t rx_address_length){
	rf24_module_write_attribute(rf24_module_attributes.rx_addr_p1, rf24_module_value_w40(rx_address, rx_address_length));
}

void rf24_module_set_rx_address_pipe2(uint8_t rx_address /*1 byte*/){
	rf24_module_write_attribute(rf24_module_attributes.rx_addr_p2, rf24_module_value_w8(rx_address));
}

