eikeviehmann/STM32_TopologyUpdateAlgorithmus/Core/Src/rf24/rf24_module/rf24_module.c
void rf24_module_set_rx_address_pipe3(uint8_t rx_address /*1 byte*/){
	rf24_module_write_attribute(rf24_module_attributes.rx_addr_p3, rf24_module_value_w8(rx_address));
}

void rf24_module_set_rx_address_pipe4(uint8_t rx_address /*1 byte*/){
	rf24_module_write_attribute(rf24_module_attributes.rx_addr_p4, rf24_module_value_w8(rx_address));
}

void rf24_module_set_rx_address_pipe5(uint8_t rx_address /*1 byte*/){
	rf24_module_write_attribute(rf24_module_attributes.rx_addr_p5, rf24_module_value_w8(rx_address));
}

void rf24_module_set_tx_address(uint8_t *tx_address /*3-5 bytes*/, uint8_t tx_address_length){
	rf24_module_write_attribute(rf24_module_attributes.tx_addr, rf24_module_value_w40(tx_address, tx_address_length));
}

void rf24_module_get_tx_address(uint8_t *tx_address_out /*3-5 bytes*/){
	value_out.w40 = tx_address_out;
	rf24_module_read_attribute(rf24_module_attributes.tx_addr, &value_out);
}

void rf24_module_set_payload_width_pipe(rf24_module_rx_pipes rx_pipe, uint8_t payload_width){

	//rf24_module_write_register(RX_PW_P0 + rx_pipe, payload_width & 0b00111111);

	switch(rx_pipe)
	{
		case 0: rf24_module_write_attribute(rf24_module_attributes.rx_pw_p0, rf24_module_value_w8(payload_width)); break;
		case 1: rf24_module_write_attribute(rf24_module_attributes.rx_pw_p1, rf24_module_value_w8(payload_width)); break;
		case 2: rf24_module_write_attribute(rf24_module_attributes.rx_pw_p2, rf24_module_value_w8(payload_width)); break;
		case 3: rf24_module_write_attribute(rf24_module_attributes.rx_pw_p3, rf24_module_value_w8(payload_width)); break;
		case 4: rf24_module_write_attribute(rf24_module_attributes.rx_pw_p4, rf24_module_value_w8(payload_width)); break;
		case 5: rf24_module_write_attribute(rf24_module_attributes.rx_pw_p5, rf24_module_value_w8(payload_width)); break;
	}
}

uint8_t rf24_module_get_payload_width_pipe(rf24_module_rx_pipes rx_pipe)
{
	return rf24_module_read_register(RX_PW_P0 + rx_pipe);
}

bool rf24_module_rx_fifo_empty(){
	rf24_module_read_attribute(rf24_module_attributes.rx_empty, &value_out);
	return value_out.w1;
}

bool rf24_module_rx_fifo_full(){
	rf24_module_read_attribute(rf24_module_attributes.rx_full, &value_out);
	return value_out.w1;
}

bool rf24_module_tx_fifo_empty(){
	rf24_module_read_attribute(rf24_module_attributes.tx_empty, &value_out);
	return value_out.w1;
}

bool rf24_module_tx_reuse(){
	rf24_module_read_attribute(rf24_module_attributes.tx_reuse, &value_out);
	return value_out.w1;
}

void rf24_module_enable_dynamic_payload_pipe(rf24_module_rx_pipes rx_pipe){
	rf24_module_write_register(/*DYNPD*/ 0x1C, rf24_module_read_register(/*DYNPD*/ 0x1C) | (1<<rx_pipe));
}

void rf24_module_disable_dynamic_payload_pipe(rf24_module_rx_pipes rx_pipe){
	rf24_module_write_register(/*DYNPD*/ 0x1C, rf24_module_read_register(/*DYNPD*/ 0x1C) & ~(1<<rx_pipe));
}

void rf24_module_enable_dynamic_payload(){
	rf24_module_write_attribute(rf24_module_attributes.en_dpl, rf24_module_value_w1(true));
}

void rf24_module_disable_dynamic_payload(){
	rf24_module_write_attribute(rf24_module_attributes.en_dpl, rf24_module_value_w1(false));
}

void rf24_module_enable_autoack_with_payload(){
	rf24_module_write_attribute(rf24_module_attributes.en_ack_pay, rf24_module_value_w1(true));
}

void rf24_module_disable_autoack_with_payload(){
	rf24_module_write_attribute(rf24_module_attributes.en_ack_pay, rf24_module_value_w1(false));
}

void rf24_module_enable_transmission_without_ack(){
	rf24_module_write_attribute(rf24_module_attributes.en_dyn_ack, rf24_module_value_w1(true));
}

void rf24_module_disable_transmission_without_ack(){
	rf24_module_write_attribute(rf24_module_attributes.en_dyn_ack, rf24_module_value_w1(false));
}

void rf24_module_flush_tx()
{
	rf24_stm32f1xx_spi_csn_low();
	rf24_stm32f1xx_spi_shift_byte(FLUSH_TX);
	rf24_stm32f1xx_spi_csn_high();
}

void rf24_module_flush_rx()
{
	rf24_stm32f1xx_spi_csn_low();
	rf24_stm32f1xx_spi_shift_byte(FLUSH_RX);
	rf24_stm32f1xx_spi_csn_high();
}

void rf24_module_collect_rx_data(rf24_module_rx_data *rx_data)
{
	rf24_module_readwrite_register(read, R_RX_PAYLOAD, rx_data->payload, 32);
	rx_data->length = 32;
	rx_data->rx_pipe = rf24_module_get_rx_available_pipe();
}

// USER FUNCTIONS

void rf24_module_goto_state(rf24_module_states goto_state)
{
	#ifdef RF24_MODULE_DEBUG_STATE_MACHINE
		usart_write_str("[rf24]: switched state from ");
		usart_write_str(rf24_module_states_string[rf24_module_state]);
	#endif

	switch(rf24_module_state){

		/* UNDEFINED -> POWER_DOWN */
		case UNDEFINED:{
			switch(goto_state){
				case POWER_DOWN:
					delay_ms(20); //10.3ms
					rf24_module_state = POWER_DOWN;
					break;
				default:break;
			}
			break;
		}

		/* POWER_DOWN -> STAND_BY_I */
		case POWER_DOWN:{
			switch(goto_state){
				case STAND_BY_I:{
					rf24_module_power_up();
					rf24_module_state = START_UP;
					delay_ms(2); //1.5ms
					rf24_module_state = STAND_BY_I;
					break;
				}
				default:break;
			}
			break;
		}

		/* STAND_BY_I -> TX_MODE, RX_MODE */
		case STAND_BY_I:{
			switch(goto_state){
				case RX_MODE:{
					rf24_module_set_prim_rx(high);
					rf24_module_set_ce(high);
					rf24_module_state = RX_SETTING;
					delay_us(130); //130us
					rf24_module_state = RX_MODE;
					break;
				}
				case TX_MODE:{
					rf24_module_set_prim_rx(low);
					rf24_module_set_ce(low);
					// ce = 1 for more than 10us
					rf24_module_set_ce(high);
					delay_us(20); // > 10us
					rf24_module_set_ce(low);
					// tx setting 130us
					rf24_module_state = TX_SETTING;
					delay_us(130); //130us
					rf24_module_state = TX_MODE;
					break;
				}
				default:break;
			}
		}

		/* TX_MODE -> STAND_BY_I */
		case TX_MODE:{
			switch(goto_state){
				case STAND_BY_I:{
					rf24_module_set_ce(low);
					rf24_module_state = STAND_BY_I;
					break;
				}
				default:break;
			}
			break;
		}

		/* RX_MODE -> STAND_BY_I */
		case RX_MODE:{
			switch(goto_state){
				case STAND_BY_I:{
					rf24_module_set_ce(low);
					rf24_module_state = STAND_BY_I;
				}
				default:break;
			}
			break;
		}

