eikeviehmann/STM32_TopologyUpdateAlgorithmus/Core/Src/rf24/rf24_module/rf24_module.c
		default: break;
	}

	#ifdef RF24_MODULE_DEBUG_STATE_MACHINE
		usart_write_str(" to ");
		usart_write_line(rf24_module_states_string[rf24_module_state]);
	#endif

}

bool rf24_module_connected(){
	rf24_module_read_attribute(rf24_module_attributes.aw, &value_in);
	return (value_in.w8 >= 1 && value_in.w8 <= 3);
}

bool rf24_module_init(uint32_t baudrate)
{
	// init hardware: system clock, timers, interrupts, pin out-/inputs, etc.
	rf24_stm32f1xx_init();
	// init usart
	rf24_stm32f1xx_usart_init(baudrate);
	// init spi
	rf24_stm32f1xx_spi_init();

	// check if rf module is responding / connected
	/*uint8_t attempts = 0;
	while(!rf24_module_connected() && attempts < 3){
		usart_write_line("rf24: module not responding, try again..");
		delay_ms(500);
		attempts++;
	}
	if(attempts >= 3){
		usart_write_line("rf24: module not responding, check pin connections");
		return false;
	}*/

	// switch to state power down (from undefined)
	rf24_module_goto_state(POWER_DOWN);

	// configure rf module
	rf24_module_config();

	// switch to rx mode over stand_by mode
	rf24_module_goto_state(STAND_BY_I);
	rf24_module_goto_state(RX_MODE);


	rf24_debug(RF_MODULE, INFO, VOID, VOID, NULL, "Initialization finished\n", "");


	return true;
}

void rf24_module_disable_autoack()
{
	rf24_module_write_register(EN_AA, 0x00);
	rf24_module_set_autoretransmit_count(rf24_module_autoretransmit_disable);
}

void rf24_module_config()
{
	rf24_module_set_rf_channel(5);
	rf24_module_set_rf_outputpower(rf24_module_rf_output_power3);
	rf24_module_set_datarate(rf24_module_datarate_250kbps);
	//rf24_module_enable_autoack_pipe(rf24_module_rx_pipe0);
	rf24_module_enable_rx_pipe(rf24_module_rx_pipe0);

	rf24_module_disable_autoack();

	rf24_module_enable_crc();
	//rf24_module_disable_crc();
	rf24_module_set_crc_length(rf24_module_crc_length_2bytes);
	rf24_module_enable_max_retries_interrupt();
	rf24_module_enable_tx_data_sent_interrupt();
	rf24_module_enable_rx_data_read_interrupt();

	rf24_module_set_address_width(rf24_module_address_width_5bytes);
	rf24_module_set_payload_width_pipe(rf24_module_rx_pipe0, 32);

	//rf24_module_set_autoretransmit_delay(rf24_module_autoretransmit_delay_750us);
	//rf24_module_set_autoretransmit_count(rf24_module_autoretransmit_count_15);
	rf24_module_set_autoretransmit_count(rf24_module_autoretransmit_disable);

	//rf24_module_enable_dynamic_payload();
	//rf24_module_enable_dynamic_payload_pipe(rf24_module_rx_pipe0);
	//rf24_module_enable_dynamic_payload_with_ack();
	//rf24_module_enable_transmission_without_ack();

	uint8_t address[5] = {'n','R','F','2','4'};
	uint8_t address_width = rf24_module_get_address_width();
	rf24_module_set_tx_address(address, address_width);
	rf24_module_set_rx_address_pipe0(address, address_width);

	rf24_module_flush_tx();
	rf24_module_flush_rx();
	rf24_module_clear_all_interrupts();
}

uint8_t rf24_module_transmit(rf24_module_tx_data *tx_data){

	// 1) flush tx___________________________________________________________________________________________
		rf24_stm32f1xx_spi_shift_byte(FLUSH_TX);

	// 2) Goto STAND_BY_I________________________________________________________________________________
		// Switch state from "RX_MODE" to "STAND_BY_I"
		rf24_module_goto_state(STAND_BY_I);

	// 3) Fill tx fifo___________________________________________________________________________________
		// Write payload into tx buffer

		uint8_t payload[32];

		for(int i=0; i<32; i++){
			if(i < tx_data->length) payload[i] = tx_data->payload[i];
			else payload[i] = '\0';
		}

		rf24_module_readwrite_register(write, W_TX_PAYLOAD, payload, 32);

	// 4) Start transmit_________________________________________________________________________________
		// Switch state from "STAND_BY_I" to "TX_MODE"
		rf24_module_goto_state(TX_MODE);

	return 1;
}

void rf24_module_attach_notify_data_received(rf24_module_rx_data_fct_ptr fct_ptr)
{
	rx_data_received_notify_fct_ptr = fct_ptr;
}

void rf24_module_attach_notify_data_transmitted(rf24_module_fct_ptr fct_ptr)
{
	tx_data_transmitted_notify_fct_ptr = fct_ptr;
}

rf24_module_rx_data* rf24_module_get_rx_data()
{
	return &rx_data;
}

void rf24_module_print_rx_data(rf24_module_rx_data *rx_data)
{
	char str[128];

	sprintf(str,
			"\nrf24_module: package with %d bytes received on pipe %d \n--------------------------------------------------------------------",
			rx_data->length,
			rx_data->rx_pipe);

	rf24_stm32f1xx_usart_write_line(str);

	int index = 0;

	for (int i=0; i<rx_data->length; i++)
		index += sprintf(&str[index], "%d ", rx_data->payload[i]);

	rf24_stm32f1xx_usart_write_str("[int]: ");
	rf24_stm32f1xx_usart_write_line(str);

	/*index = 0;
	for (int i=0; i<rx_data->length; i++)
		index += sprintf(&str[index], "%c", rx_data->payload[i]);

	rf24_stm32f1xx_usart_write_str("[ascii]: ");
	rf24_stm32f1xx_usart_write_line(str);*/
	rf24_stm32f1xx_usart_write_str("\n");
}

void rf24_module_irq_handler()
{
	if(rf24_module_max_retransmits())
	{
		rf24_module_flags.max_retransmits = true;

		// switch back to receiver mode
		rf24_module_goto_state(STAND_BY_I);
		rf24_module_goto_state(RX_MODE);

		#ifdef RF24_MODULE_DEBUG_IRQ
			rf24_debug("max retransmits");
		#endif
	}

	if(rf24_module_package_transmitted())
	{
		rf24_module_flags.package_transmitted = true;

		// switch back to receiver mode
		rf24_module_goto_state(STAND_BY_I);
		rf24_module_goto_state(RX_MODE);

		// if a callback function attached, notify
		// [WARNING:] DONT ATTACH ANY LONG PROCEEDINGS TO THIS NOTIFY
		if(tx_data_transmitted_notify_fct_ptr)
			tx_data_transmitted_notify_fct_ptr();

		#ifdef RF24_MODULE_DEBUG_IRQ
			rf24_debug("package transmitted");
		#endif
	}

	if(rf24_module_rx_data_available())
	{
		rf24_module_flags.package_received = true;

		// read rx data from chip, store it into global struct rx_data
		rf24_module_collect_rx_data(&rx_data);

		// if a callback function attached, notify
		// [WARNING:] DONT ATTACH ANY LONG PROCEEDINGS TO THIS NOTIFY
		if(rx_data_received_notify_fct_ptr)
			rx_data_received_notify_fct_ptr(&rx_data);

		#ifdef RF24_MODULE_DEBUG_IRQ
			rf24_module_print_rx_data(&rx_data);
		#endif
	}

	rf24_module_clear_all_interrupts();
}
